openFOAM CFD Code + Invasive Weed Optimization Code/CFD/0.orig/thickness
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    front
    {
        type            fixedValue;
        value           uniform 0;
    }
    back
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
    "(VAWT1|VAWT2|VAWT3|SHAFT)"
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
2312
(
0
0
0
0
0
0
0
0
...
)
;
    }
    AMI
    {
        type            fixedValue;
        value           uniform 0;
    }
    AMI_slave
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
